In [1]:
import pandas as pd
import numpy as np

# Creating a dataframe from an array

In [2]:
# array

data = np.array([[1,6], [3,4], [2,3]])

In [3]:
# DataFrame

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
             columns=['col1', 'col2'])

In [4]:
df

      col1  col2
row1     1     6
row2     3     4
row3     2     3

In [5]:
data = [[1,6], [3,4], [2,3]]
data

[[1, 6], [3, 4], [2, 3]]

In [6]:
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
             columns=['col1', 'col2'])

In [7]:
df

      col1  col2
row1     1     6
row2     3     4
row3     2     3

In [8]:
Bundesländer = ['NRW', 'Bayern', 'Hessen', 'Sachsen']
Einwohnerzahl = [17925570, 13140183, 6293154, 4056941]

In [9]:
dict_Bundesländer = {'Bundesländer': Bundesländer, 'Einwohnerzahl': Einwohnerzahl}

In [10]:
dict_Bundesländer

{'Bundesländer': ['NRW', 'Bayern', 'Hessen', 'Sachsen'],
 'Einwohnerzahl': [17925570, 13140183, 6293154, 4056941]}

In [11]:
df_Einwohnerzahl = pd.DataFrame(dict_Bundesländer)

In [12]:
df_Einwohnerzahl

  Bundesländer  Einwohnerzahl
0          NRW       17925570
1       Bayern       13140183
2       Hessen        6293154
3      Sachsen        4056941

# Dataframe from csv

In [13]:
df_Arbeit = pd.read_csv('StudentsPerformance.csv')

In [14]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [15]:
df_Arbeit.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [16]:
df_Arbeit.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [17]:
df_Arbeit.shape

(1000, 8)

In [18]:
pd.set_option('display.max_rows', 1000)

# Attributes

In [20]:
df_Arbeit.index

RangeIndex(start=0, stop=1000, step=1)

In [21]:
df_Arbeit.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [22]:
df_Arbeit.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

# Methods

In [23]:
df_Arbeit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [24]:
df_Arbeit.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

# Function

In [25]:
len(df_Arbeit)

1000

In [26]:
max(df_Arbeit.index)

999

In [27]:
min(df_Arbeit.index)

0

In [28]:
type(df_Arbeit)

pandas.core.frame.DataFrame

In [29]:
round(df_Arbeit, 2).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Select one Column

In [30]:
df_Arbeit['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [31]:
type(df_Arbeit['gender'].head())

pandas.core.series.Series

In [32]:
df_Arbeit['gender'].index

RangeIndex(start=0, stop=1000, step=1)

# Syntax

In [33]:
df_Arbeit.gender.head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [34]:
df_Arbeit['math score'].head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64

# Multiple Column

In [35]:
df_Arbeit[['gender', 'math score']].head()

   gender  math score
0  female          72
1  female          69
2  female          90
3    male          47
4    male          76

In [36]:
type(df_Arbeit[['gender', 'math score']].head())

pandas.core.frame.DataFrame

In [37]:
df_Arbeit[['math score', 'reading score', 'writing score']].head()

   math score  reading score  writing score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

# Add Column

In [38]:
df_Arbeit['Rechtschreibung'] = 70

In [39]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70
2,female,group B,master's degree,standard,none,90,95,93,70
3,male,group A,associate's degree,free/reduced,none,47,57,44,70
4,male,group C,some college,standard,none,76,78,75,70

In [40]:
Rechtschreibung = np.arange(0, 1000)

In [41]:
len(Rechtschreibung)

1000

In [42]:
df_Arbeit['Rechtschreibung'] = Rechtschreibung
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4

In [43]:
Rechtschreibung_2 = np.random.randint(1, 100, size=1000)

In [44]:
df_Arbeit['Rechtschreibung'] = Rechtschreibung_2
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung
0,female,group B,bachelor's degree,standard,none,72,72,74,63
1,female,group C,some college,standard,completed,69,90,88,61
2,female,group B,master's degree,standard,none,90,95,93,75
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,46

In [45]:
np.random.uniform(1, 100, size=1000)

array([68.77320464, 13.31489969, 22.02282678, 70.37457166, 63.14380062,
       82.45272992, 98.56916989, 47.0625637 , 26.50900674, 26.62214282,
       35.2146767 , 23.1450306 , 53.20666599, 64.02127551, 31.36803514,
       99.3596595 , 69.15937373, 26.12227497, 22.93656069, 13.20704389,
       48.65089285, 92.90797576, 62.44750132, 91.55115017, 39.056764  ,
       78.4367046 , 82.82933549, 19.1867872 , 76.53509657, 34.27332639,
       41.97052674, 96.4621917 , 61.57290552, 21.31788098,  6.45808935,
        1.40654163, 20.35579661,  8.2382609 , 46.97909597, 14.33858825,
       86.2345761 , 60.83608558, 19.07574679, 11.87800264, 22.08019526,
       58.02131008, 61.30298846, 93.60560415, 10.62921461, 19.45614229,
       78.69213121, 84.61940249, 23.51624742, 50.30349285, 31.31554559,
       45.88227532, 22.74519978, 78.70755571, 73.28156838, 38.02139067,
       23.10459448, 26.9089913 ,  8.74698344, 32.86460268, 49.93118309,
       84.20026471, 40.46745605, 38.95694177, 24.24509762, 79.01136338,
       83.4436357 , 85.84784443, 92.29159012, 95.938425  , 77.44710863,
       20.65277052, 97.40675804, 72.26566604, 50.75082497, 17.10690951,
       71.40607875, 95.49223485, 35.61733929, 16.52741819, 21.0207331 ,
       54.56116541, 95.98220312, 97.25977114, 10.9874004 , 81.89188094,
        8.02824552, 57.77470073, 39.6542291 , 77.49624282, 29.19260218,
       56.26897614,  2.49277668, 39.28582747, 34.45752853, 45.67787894,
        4.75816239, 48.45569488, 57.45703331, 84.10291818, 68.00711653,
       61.86593189, 98.23497908, 22.87730434,  2.82714173, 54.43275172,
       84.39044311, 14.45858721, 51.83850175, 94.18169398, 22.88275604,
       32.73208088, 10.34066728,  1.58538616, 33.26189963, 45.19475348,
       72.67177805, 80.17002655,  6.76542278, 44.67009144, 55.07576802,
       11.40688361, 12.67629105, 87.0220764 ,  2.4816851 , 67.57238695,
       24.17855343, 79.05177048, 39.21040268,  3.28597843, 98.72123666,
       89.00919824, 26.6698572 , 66.5508713 , 24.46550533, 21.28710154,
       76.48068673, 64.92507853, 14.7104218 , 13.99246179,  9.35763911,
       81.74396315, 35.78825534, 33.57444581, 57.00192038, 52.63747871,
       83.75980232, 82.7833731 , 24.69639134, 19.60206132, 52.50568901,
       49.95119682,  4.98901874, 14.40292047, 20.94338909, 97.55127194,
       49.35901821, 39.3441508 , 99.29121343, 97.19747619, 16.39069923,
        1.90847119, 45.22844423, 37.44261717, 69.32173222, 73.94316816,
        9.58346084, 87.76922885, 29.94892878, 31.15735861, 64.92135148,
       35.6462652 , 26.3444859 , 42.95531532,  8.36269383,  3.20993909,
       65.39129717, 87.19826816, 72.41618573, 16.01003714, 27.1848435 ,
       49.93339924, 43.98258103, 38.55103735, 41.67102657, 76.71420055,
       82.67528952, 24.85548671,  6.23618126, 69.39931484, 43.34456585,
       32.37832463, 72.57166601, 67.66501842, 20.07408875, 16.59307202,
       11.52172239, 70.30096176, 98.27085257, 49.01477761, 86.69689441,
       81.17724555, 69.7850061 , 23.76136227, 46.80212302, 29.2512292 ,
       10.49762716,  1.14030466, 85.41472418, 65.04784379, 57.66526105,
       52.86702035, 25.52927175, 99.18309814, 73.44095147, 49.77768869,
       28.9303165 , 20.45592022, 22.0621782 ,  1.00168535, 70.06073017,
       79.83562129, 75.99468216, 63.43340829, 50.05821439, 10.28051732,
       31.29313965,  6.48657417, 26.50234972, 25.95776747, 44.2296606 ,
       48.58560003, 98.34952578, 37.25017095, 62.59461863, 14.38504791,
       84.48611955, 16.03868813, 62.79794439, 36.67989423,  3.34693693,
       42.18061095, 60.87084082, 20.89999479, 67.04371109, 24.51079775,
       26.71961646, 94.30024759, 18.83940669,  9.74935201, 59.06435384,
       74.28093319, 89.98558215, 80.10538291, 72.49754606, 96.75872713,
        2.34849891, 65.73977319, 11.68653102, 32.66737848, 91.03342359,
       72.16883154, 12.17739122,  8.16509594,  3.27473376,  7.33959559,
       12.46092902, 75.49840523, 30.64732564, 93.62990164, 26.31557657,
       89.95264931, 20.80620784, 13.67036377, 89.94023091,  6.72385469,
        8.51427259, 29.43096   , 92.24411618, 76.33100745, 58.10808807,
       12.57049525, 18.66891628, 92.91788484, 65.57499414, 27.99610356,
       36.79765673, 63.42984543, 69.58161697, 84.06478957, 35.89294833,
       70.40779356, 64.89754191, 71.21483861, 11.53405719, 24.12416121,
       34.20965664, 11.81533723, 41.29727276, 13.94649062, 19.83259074,
       85.26883635, 59.68788417, 78.11128741, 42.72792642, 73.03506542,
       36.77461063, 81.00126354, 86.47143084, 34.26769969, 70.5104102 ,
       28.71025363, 25.30165529, 68.30932252, 82.43826313,  1.56651898,
       90.29768263, 90.61202816,  3.78230276, 22.23481897, 94.77287396,
       82.91051607, 76.69637304, 96.95457639, 20.61515539, 57.74578267,
       84.54566267, 15.24551168, 57.59833273, 87.83616211, 20.72128643,
       17.60761555, 14.4784451 , 57.95914002, 73.75244137, 20.75786321,
       49.81923547, 88.7248065 ,  2.48505453, 82.65148211, 19.26876798,
       85.41136572, 21.63057665, 42.58386338, 91.76568574, 37.38032709,
       97.40641578, 19.62040965, 34.39415808,  9.77189076, 25.25676787,
       24.30836943, 13.36908135, 15.01537107,  6.17275642, 28.03375457,
       10.07926937, 19.02192368, 84.80999818, 59.33490066, 74.78134474,
       41.70008005, 70.30779191, 95.63121742, 33.62882256, 26.26623458,
       37.26049512, 61.1503207 , 86.08561907, 57.3560767 , 64.37264679,
       16.19683172, 54.94987341, 49.61998224, 51.19244839, 58.01155995,
       22.69368054,  2.39627207, 76.40398624, 76.45001209, 50.87014094,
       77.21628337, 93.67435195, 81.67124895, 96.51070729, 50.83387329,
       87.47076368, 41.97909108, 78.57294233, 18.4069536 , 66.35292971,
       31.78243197, 35.11916075, 60.07353965, 87.11148079, 77.72614738,
       21.20739391, 48.92191558, 43.32491257, 68.28274287, 75.32630431,
       60.03263548, 99.56474513,  9.41260408, 50.32096328, 51.98656519,
        1.5557823 , 89.60459812, 66.61475999, 30.777477  , 13.29987856,
       61.60560015, 93.82398522, 71.13523141, 77.85607233, 72.22707917,
       69.08100944, 89.4218661 , 22.40208208, 63.49323432, 10.86054722,
       13.66509102, 81.56919387, 12.68541317, 76.14435331, 88.62427848,
       29.48787165, 25.1563553 , 28.09320173, 95.11431228, 35.57826396,
       71.55785975, 78.1732039 , 40.2544793 , 66.91670802, 41.3252685 ,
       63.21347344,  3.54741073, 11.15666076, 58.61697301, 11.51316844,
       41.40061366, 33.22310143, 64.42889086, 96.02705222,  1.08810312,
       21.86871271, 38.23643215, 43.28574218, 67.46374439, 68.51771668,
       23.169514  , 53.83259035, 22.17221062, 30.64925756, 28.92839539,
       24.2578388 , 44.11189341, 90.12385165, 14.22653342,  4.07110329,
       27.41601669, 10.93369584, 19.47953224, 76.53193679, 36.23383069,
       70.97012517,  9.26980186, 30.30907906, 47.41415108, 73.26023484,
       92.4731604 , 99.97575799, 72.29029159,  4.27212227, 64.73057494,
       57.88772269, 13.55707466, 98.8486757 , 84.73710585, 42.95965467,
       39.42842462, 72.65844446,  2.48452762,  2.24917044, 28.19686255,
        6.15274081, 12.75739977, 41.74612621, 90.86886889, 85.55596986,
       30.57183258, 93.47051193, 27.56265045,  3.13461052, 70.08327741,
       51.09847944, 49.293594  , 13.89658627, 71.13334971, 93.42142242,
       53.54056913, 31.69271647,  6.67006094, 39.71752726, 69.70910056,
       27.19667139, 53.96313361, 17.5672405 , 28.52362103, 98.59779874,
       44.82127085, 40.38038115, 83.71856181, 86.38975072, 88.1216818 ,
       53.2089879 , 73.92059521, 20.98554411, 71.78157492, 33.1752925 ,
       54.78653444, 38.23571637, 64.47270118, 60.01963119, 86.69793674,
       25.96633746, 69.6072213 , 96.71548581, 89.64087417, 72.28175323,
       61.62368763, 19.42324364, 13.0900288 , 54.42304422, 54.19918066,
       94.00894995, 60.43814453, 59.79880128, 45.00244327, 56.01072934,
       36.49967491, 67.90742822, 70.21433602, 31.57085208, 26.0126555 ,
       95.14849939, 66.81337739, 44.9451768 , 64.00808411, 55.15633173,
       78.25748213, 31.02610288, 35.11409466, 87.46700151, 95.03884488,
       65.2867544 , 30.84723753, 94.3277399 , 44.9341108 , 51.05654687,
       31.9855861 , 39.27868777, 31.52589393, 96.72866856, 98.02952542,
       77.99737113, 41.5430129 , 90.97857673, 12.10323734, 87.88609732,
       13.15354999, 37.1200171 , 36.92793787,  6.2032474 , 36.97350451,
       12.34686764, 49.07608836, 47.69165955, 93.81980742, 37.24356266,
       45.45553149, 63.54711233, 69.25334152, 19.22972075,  8.20512251,
       37.40197082, 86.12910835, 50.99353828, 98.42617572, 46.81805039,
       14.32859229, 39.67465731, 82.87580495, 66.38375373, 94.74798543,
       54.42794384, 78.7349956 , 37.8139591 , 65.53233912, 66.58084812,
       43.33094738, 32.61166852, 16.61119477, 63.50565855, 92.01985178,
       86.30902503, 24.98685854, 64.80306822, 36.01242705, 35.00026666,
       13.50977913, 20.80370609, 29.43398997,  2.25998853, 72.60212071,
       99.22063789, 85.11157886, 45.78440202, 27.28551986, 32.06968599,
       59.30726755, 80.13809024, 57.72702922, 58.5541349 , 41.19952828,
       26.59695874, 44.406124  , 14.4286771 , 79.59916001, 74.38890719,
       57.79244854, 58.52769682, 96.2831834 , 82.12437313, 63.02515993,
       86.76719271, 14.43914763, 19.71608593, 71.90718677, 38.76493698,
       58.79778628,  6.68576082,  8.43495863, 34.75693165,  2.62530553,
       53.40266764, 71.30901416, 36.84980713,  8.84565052, 70.01220991,
       25.5263489 , 72.2364684 , 37.54905457, 81.1801547 , 22.06847928,
       95.05114341, 72.38239866, 18.24446076, 46.65369742, 48.94216863,
       19.04147422, 92.37205745, 70.36263483, 72.70359908, 34.29422002,
       49.04443489, 75.91613999, 37.45470927, 24.22687221, 65.20009826,
       87.87413216, 83.09956066, 64.11875994, 77.02518761, 93.20765534,
       60.24141172, 75.39299365, 72.82225335, 93.48611304, 61.44205056,
       91.93257829, 61.36899481, 71.06829684, 60.72936506, 38.62752161,
       70.85171036, 14.68391552, 42.50383347, 57.45357111, 23.15773057,
       57.14637591, 76.88586753, 81.64523474,  4.53343169, 75.84403637,
       74.84593096,  1.79371592, 52.5860799 , 14.16816719, 87.81236596,
        4.18133826, 48.72540155, 32.44426394, 41.2679143 , 79.59201013,
       26.39652011, 25.19175783, 77.94963843, 88.19505397, 52.94983298,
       79.21063191, 47.2395337 , 25.95261359, 70.31690061, 89.36634434,
       98.19543351, 43.11336861, 14.72177492,  5.72601369, 32.07854833,
       63.21586262, 74.56825407, 19.84844558, 47.95219253, 34.86121342,
       85.15372331, 12.69536097, 36.09682329, 75.03467403, 84.06984932,
       77.25768646, 80.24419908, 75.83518783, 46.55705278, 49.18375938,
        3.1770406 , 27.73610793, 25.76360555, 90.90152711, 63.36658838,
       34.43351464, 78.87993757,  1.11434478, 18.22761707, 54.63337813,
       40.69263286, 69.09673135, 93.76865198, 42.87311596, 75.94416557,
       60.37780428, 78.769524  , 36.82456714,  7.71414825, 72.91391056,
       25.70056045, 30.02447862, 20.34260828, 58.55019488, 67.3482857 ,
       61.59762284, 22.25264124, 44.56175597, 91.83009618, 52.56577652,
       15.8124083 , 34.27447487, 53.93366506, 68.50589415, 64.01569291,
        5.81656743, 81.15223705,  5.1779905 , 93.90929004, 74.85702675,
       10.26347677, 67.98919432, 14.94896744, 64.20434256,  7.15890179,
       34.53371143, 93.78039512, 62.08686742, 10.1151949 , 91.53261578,
       58.80020323, 90.30723942, 35.20859934,  2.76469363, 27.16484933,
       83.97232666,  7.94373306,  6.887117  , 75.640892  , 13.41213577,
       66.45786977, 16.39216731, 84.63348766, 89.66726969, 68.9401472 ,
       16.72438137, 37.19806698, 28.18739696, 64.03429771, 65.99281122,
       97.97961557, 65.13100478, 76.74718842, 63.48820513, 34.59748061,
       11.89524602, 86.42439697, 80.73794356, 66.22604279, 45.31470457,
        4.56339251,  7.62966822, 77.68693204, 12.82786946, 23.66602486,
       35.43540116, 71.41935677, 59.93170937, 37.98440601, 89.34892953,
       59.40310551, 67.47325435,  8.9392141 , 34.24885971, 11.71467287,
       85.62587199, 30.54121437, 15.23381453, 87.34978041, 92.39917576,
       55.36898744, 73.4807892 , 20.55016169, 12.56790002, 82.07326263,
       27.81379877, 73.58186713, 82.43849624, 14.94754453, 27.15357387,
       94.80344144, 75.9012292 , 14.72947222, 31.0842939 , 94.5665896 ,
        1.57342203, 79.18602277, 22.34156818, 48.31381856,  4.75060002,
       37.63526692, 49.00758719, 33.26666609, 77.91193112, 32.74446034,
       62.87550333, 53.11208658, 44.7436233 , 41.76803389, 31.87175171,
       59.07274908, 56.21494222, 88.75774237, 44.24520647, 35.75253797,
       15.73222092, 55.35234449, 99.12701549, 81.75572623, 20.1674282 ,
       98.8666685 ,  4.90440993, 83.15098073, 95.26440592, 60.49889121,
       40.75924965, 12.79636879, 25.1081317 ,  9.84317928, 90.80872054,
       54.83546994, 24.13665907, 16.32296312, 83.00937887, 71.99933601,
       77.02668319,  2.35815327, 77.59124298, 86.88032507, 82.26640977,
       72.28348887, 46.70715305, 82.60064585, 96.28886758, 53.39995492,
       33.49151132, 96.5488757 , 29.21782353, 50.03830493, 13.14893466,
       49.96485018, 36.89660275, 14.67197397, 97.0505381 , 30.50685701,
       14.32627784,  5.24205126, 78.1037873 , 21.81453436, 72.45868576,
       59.15697781, 50.88120239, 87.34196105, 80.49246939, 72.53186001,
       70.81521233, 81.11715468, 40.19132919, 95.2326424 , 28.32112865,
       80.36526514, 73.44156305, 10.01880696, 31.70752802, 63.47860233,
       44.50034125, 91.66399913, 51.05601443, 38.55554059, 68.52252958,
       35.21242685, 94.63238173, 74.59790336, 85.58838904, 78.94699668,
       40.57777412, 64.15900132, 46.95304086, 28.35732307, 41.70565245,
       36.77258586, 71.78092394, 41.24850053, 49.13962059, 17.36569713,
       80.62470654, 84.58393893, 72.94794121, 80.68574198, 33.77931535,
       12.0621874 , 83.98437669, 14.15697046, 73.40869252, 37.17750703,
        8.01611151, 55.47553842, 23.87730668, 60.24545379, 43.49603669,
       95.97458841, 18.56415533, 82.52997415, 35.50603149, 80.879473  ,
       94.37805794, 37.92516329, 25.09614888, 10.36771179, 51.4173208 ,
       53.55476591, 70.36811139, 28.77185049, 91.13804034, 84.75946837,
        8.68151078, 24.67114489, 89.45856912, 54.34352096, 55.39266297,
       24.00830499, 25.5988525 , 62.7221394 , 57.97093954, 55.03147207,
        1.67823315, 11.54570571, 59.47219082, 54.22972222, 89.44636627])

# Math Operations

In [46]:
df_Arbeit['math score'].sum()

66089

In [47]:
print(df_Arbeit['math score'].count())
print(df_Arbeit['math score'].mean())
print(df_Arbeit['math score'].std())
print(df_Arbeit['math score'].max())
print(df_Arbeit['math score'].min())

1000
66.089
15.16308009600945
100
0

In [48]:
df_Arbeit.describe()

       math score  reading score  writing score  Rechtschreibung
count  1000.00000    1000.000000    1000.000000      1000.000000
mean     66.08900      69.169000      68.054000        50.866000
std      15.16308      14.600192      15.195657        28.419354
min       0.00000      17.000000      10.000000         1.000000
25%      57.00000      59.000000      57.750000        27.000000
50%      66.00000      70.000000      69.000000        52.500000
75%      77.00000      79.000000      79.000000        75.000000
max     100.00000     100.000000     100.000000        99.000000

In [52]:
(df_Arbeit['math score'] + df_Arbeit['reading score'] + df_Arbeit['writing score']).head()

0    218
1    247
2    278
3    148
4    229
dtype: int64

In [50]:
df_Arbeit['Durchschnittliches ergebniss'] = (df_Arbeit['math score'] + df_Arbeit['reading score'] + df_Arbeit['writing score'])/3

In [51]:
df_Arbeit.head().round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
0,female,group B,bachelor's degree,standard,none,72,72,74,63,72.67
1,female,group C,some college,standard,completed,69,90,88,61,82.33
2,female,group B,master's degree,standard,none,90,95,93,75,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,3,49.33
4,male,group C,some college,standard,none,76,78,75,46,76.33

# Value Counts

In [53]:
len(df_Arbeit['gender'])

1000

In [58]:
df_Arbeit['gender'].count()

1000

In [59]:
df_Arbeit['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [60]:
df_Arbeit['gender'].value_counts(normalize=True)

female    0.518
male      0.482
Name: gender, dtype: float64

In [61]:
df_Arbeit['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [63]:
df_Arbeit['parental level of education'].value_counts(normalize=True).round(2)

some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: parental level of education, dtype: float64

# Sort DataFrame

In [69]:
df_Arbeit.sort_values(by='math score', ascending=False).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
962,female,group E,associate's degree,standard,none,100,100,100,24,100.000000
625,male,group D,some college,standard,completed,100,97,99,69,98.666667
458,female,group E,bachelor's degree,standard,none,100,100,100,51,100.000000
623,male,group A,some college,standard,completed,100,96,86,30,94.000000
451,female,group E,some college,standard,none,100,92,97,58,96.333333

In [71]:
df_Arbeit.sort_values(['math score', 'reading score', 'writing score'] , ascending=False).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
458,female,group E,bachelor's degree,standard,none,100,100,100,51,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,82,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,24,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,94,97.666667
625,male,group D,some college,standard,completed,100,97,99,69,98.666667

In [ ]:
df_Arbeit.head()

In [77]:
df_Arbeit.sort_values(['math score', 'reading score', 'writing score'] , ascending=False,
                      inplace=True)

In [78]:
df_Arbeit.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
458,female,group E,bachelor's degree,standard,none,100,100,100,51,100.000000
916,male,group E,bachelor's degree,standard,completed,100,100,100,82,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,24,100.000000
149,male,group E,associate's degree,free/reduced,completed,100,100,93,94,97.666667
625,male,group D,some college,standard,completed,100,97,99,69,98.666667

In [83]:
df_Arbeit.sort_values('race/ethnicity', ascending=True).head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Rechtschreibung,Durchschnittliches ergebniss
688,male,group A,high school,free/reduced,none,53,58,44,79,51.666667
365,male,group A,bachelor's degree,free/reduced,completed,49,58,60,54,55.666667
769,male,group A,some college,free/reduced,none,58,60,57,73,58.333333
490,female,group A,associate's degree,free/reduced,none,65,85,76,35,75.333333
820,female,group A,some high school,standard,completed,85,90,92,75,89.000000

# Pivot Tables

In [ ]:
df.pivot(index='A',
         columns='b',
         values='c')